#+PROPERTY: Effort_ALL 1 2 3 5 8 13 21 34
#+PROPERTY: priority_ALL Y N
#+COLUMNS: %70ITEM(Task) %6Effort %allocate %priority
#+CONSTANTS: total_days=60. effort_max=34

     #+BEGIN: columnview :hlines 1 :id global
     | Task                                                                                     | Effort | days | allocate | priority |
     |------------------------------------------------------------------------------------------+--------+------+----------+----------|
     | * Identificacion                                                                         |        |    0 |          |          |
     | ** TRAMA                                                                                 |        |    0 |          |          |
     |------------------------------------------------------------------------------------------+--------+------+----------+----------|
     | * Investigacion                                                                          |        |    0 |          |          |
     | ** MBC-PLAYOUT                                                                           |        |    0 |          |          |
     | *** Scientifica                                                                          |        |    0 |          |          |
     | **** Codecs y optimizaciones                                                             |        |    0 |          |          |
     | **** Tratamiento de senal en tiempo real                                                 |        |    0 |          |          |
     | **** shreding distribuido resiliante                                                     |        |    0 |          |          |
     | *** Tecnica                                                                              |        |    0 |          |          |
     | **** Applicaciones web reactivas                                                         |        |    0 |          |          |
     | **** precision, interoperacion y cooperacion de processos                                |        |    0 |          |          |
     | **** Metadata embedida en archivos de medios                                             |        |    0 |          |          |
     | **** filesystems                                                                         |        |    0 |          |          |
     | **** transcoding                                                                         |        |    0 |          |          |
     | **** integracion IMDB                                                                    |        |    0 |          |          |
     | *** Operativa                                                                            |        |    0 |          |          |
     | **** indexacion en base de datos distribuida                                             |        |    0 |          |          |
     | **** busqueda optimizada de amplio dataset distribuido                                   |        |    0 |          |          |
     | **** Deteccion automatizada de cuadros negros totales                                    |        |    0 |          |          |
     | **** Deteccion automatizada de cuadros negros parciales                                  |        |    0 |          |          |
     | **** Deteccion de baja, distrurbio o falta de sonido                                     |        |    0 |          |          |
     |------------------------------------------------------------------------------------------+--------+------+----------+----------|
     | * Desarrollo                                                                             |        |    0 |          |          |
     | ** MBC-PLAYOUT                                                                           |        |    0 |          |          |
     | *** Ingesta                                                                              |        |    0 |          |          |
     | **** Ingesta automatica (gstfs)                                                          |     21 |   12 |          | Y        |
     | ***** bindings c - node-config                                                           |        |    0 |          | Y        |
     | ***** transcoding                                                                        |        |    0 |          | Y        |
     | ***** plugins                                                                            |        |    0 |          |          |
     | ****** deteccion aplanamiento colorspace                                                 |        |    0 |          |          |
     | ****** deteccion silencio                                                                |        |    0 |          |          |
     | ****** deteccion cuadros negros                                                          |        |    0 |          |          |
     | ***** clasificarlos para el futuro uso, e indexacion rapida.                             |        |    0 |          |          |
     | ****** filter md5                                                                        |        |    0 |          |          |
     | ****** filter mongo                                                                      |        |    0 |          |          |
     | ****** filtro_generico                                                                   |        |    0 |          |          |
     | ***** convertir al formato y estandard de uso interno al system,                         |        |    0 |          |          |
     | ****** mapping node-config -> libav{codec,format}                                        |        |    0 |          |          |
     | ***** extraccion/agregacion de metadata                                                  |        |    0 |          |          |
     | ****** filter_grilo                                                                      |        |    0 |          |          |
     | ****** filter_avmetadata                                                                 |        |    0 |          |          |
     | **** tags de contenidos                                                                  |      8 |    5 |          |          |
     | ***** filesystem                                                                         |        |    0 |          |          |
     | ***** ui                                                                                 |        |    0 |          |          |
     | ***** search                                                                             |        |    0 |          |          |
     | ***** integracion de grafica                                                             |        |    0 |          |          |
     | ***** UI                                                                                 |        |    0 |          |          |
     | ***** search                                                                             |        |    0 |          |          |
     | ***** FS                                                                                 |        |    0 |          |          |
     | ****** filter ffmpeg                                                                     |        |    0 |          |          |
     | ****** filter grilo                                                                      |        |    0 |          |          |
     | ****** perceptua hash                                                                    |        |    0 |          |          |
     | ***** grafica                                                                            |        |    0 |          |          |
     | ****** autogenerar grafica por tag                                                       |        |    0 |          |          |
     | *** Administracion                                                                       |        |    0 |          |          |
     | **** listas autogeneradas                                                                |      5 |    3 |          |          |
     | ***** UI                                                                                 |        |    0 |          |          |
     | **** Configuracion centralizada                                                          |      5 |    3 |          | Y        |
     | ***** UI                                                                                 |        |    0 |          | Y        |
     | ****** widgets                                                                           |        |    0 |          |          |
     | ****** polish                                                                            |        |    0 |          |          |
     | ***** mosto drivers                                                                      |        |    0 |          |          |
     | **** Edicion no lineal basica: in, out, cut                                              |      8 |    5 |          |          |
     | ***** stream MLT                                                                         |        |    0 |          |          |
     | **** herencia entre playlists                                                            |      3 |    2 |          |          |
     | ***** backbone relational                                                                |        |    0 |          |          |
     | *** Generacion de Graficos                                                               |        |    0 |          |          |
     | **** Edicion de Graficos                                                                 |     13 |    8 |          |          |
     | **** Composición de diferentes ingestas en una señal de video,                           |        |    0 |          |          |
     | **** Composición o mezcla de audio y sonido por separado.                                |        |    0 |          |          |
     | **** Inserción de gráficos para diversos usos.                                           |        |    0 |          |          |
     | **** Inserción de subtítulos y textos varios (placas).                                   |        |    0 |          |          |
     | **** Filtros                                                                             |        |    0 |          |          |
     | **** Conversión de aspectos, tonalidades, colores, etc.                                  |        |    0 |          |          |
     | **** Zocalos dinamicos, independientes de la playlist o el clip (con su propio schedule) |        |    0 |          |          |
     | **** TODO                                                                                |        |    0 |          |          |
     | *** Programacion                                                                         |        |    0 |          |          |
     | **** Configuración Web de la programacion con vista de calendario                        |      8 |    5 |          |          |
     | **** Reproducción automática                                                             |     13 |    8 |          | Y        |
     | ***** mosto / refactor                                                                   |        |    0 |          | Y        |
     | ****** backbone playlist (fetch)                                                         |        |    0 |          | Y        |
     | ****** backbone sync                                                                     |        |    0 |          | Y        |
     | ****** migrar a event emitter                                                            |        |    0 |          | Y        |
     | ****** backbone drivers                                                                  |        |    0 |          | Y        |
     | ****** Driver MVCP                                                                       |        |    0 |          |          |
     | **** Vista aplanada del calendario: playout view                                         |      5 |    3 |          | Y        |
     | ***** snap UI                                                                            |        |    0 |          |          |
     | ***** shadow size                                                                        |        |    0 |          |          |
     | ***** update FullCalendar                                                                |        |    0 |          |          |
     | ***** Occurrence edit time                                                               |        |    0 |          |          |
     | **** override rapido de contenidos al aire                                               |      1 |    1 |          |          |
     | ***** play now view                                                                      |        |    0 |          |          |
     | ***** mosto override                                                                     |        |    0 |          |          |
     | **** Streamer MELT                                                                       |     21 |   12 |          |          |
     | *** Monitoreo                                                                            |        |    0 |          |          |
     | **** Estatus en tiempo real del aire                                                     |      2 |    2 |          |          |
     | **** Demonios de control                                                                 |      8 |    5 |          |          |
     | **** reporte de reproducion/programacion                                                 |      2 |    2 |          |          |
     | *** Playout                                                                              |        |    0 |          |          |
     | **** Melted Multicast                                                                    |        |    0 |          | Y        |
     | ***** Streaming a Web                                                                    |      5 |    3 |          | Y        |
     | ***** Playout a SDI                                                                      |      1 |    1 |          |          |
     | ***** Playout a compuesto                                                                |      1 |    1 |          | Y        |
     | ***** Streaming TS para TDA                                                              |      2 |    2 |          |          |
     |------------------------------------------------------------------------------------------+--------+------+----------+----------|
     | * Pruebas                                                                                |        |    0 |          |          |
     | ** MBC-PLAYOUT                                                                           |        |    0 |          |          |
     | *** Tests Unitarios                                                                      |        |    0 |          |          |
     | *** Tests Funcionales                                                                    |        |    0 |          |          |
     | *** Alpha testing                                                                        |        |    0 |          |          |
     | *** Beta Testing                                                                         |        |    0 |          |          |
     | *** Cyclos RC                                                                            |        |    0 |          |          |
     #+TBLFM: $3=ceil($2*$effort_max/$total_days)
#+END:


* Identificacion
:PROPERTIES:
:END:
** TRAMA
* Investigacion
** MBC-PLAYOUT
*** Scientifica
**** Codecs y optimizaciones
**** Tratamiento de senal en tiempo real
**** shreding distribuido resiliante

*** Tecnica
**** Applicaciones web reactivas
**** precision, interoperacion y cooperacion de processos
     
**** Metadata embedida en archivos de medios
**** filesystems
**** transcoding
**** integracion IMDB
*** Operativa
**** indexacion en base de datos distribuida
**** busqueda optimizada de amplio dataset distribuido
**** Deteccion automatizada de cuadros negros totales
**** Deteccion automatizada de cuadros negros parciales
(discriminacion de grafica)
**** Deteccion de baja, distrurbio o falta de sonido
* Desarrollo
** MBC-PLAYOUT
*** Ingesta
**** Ingesta automatica (gstfs)
:PROPERTIES:
:Effort:   21
:priority: Y
:END:
Transcoding y normalizacion.

Ingesta: parte del systema que se encarga de recibir los archivos
multimediales y tratarlos para ser aptos a ser consumidos y reproducidos
por los distintos elementos del sistema.

Requisitos tecnicos:

***** bindings c - node-config
:PROPERTIES:
:priority: Y
:END:
comunicacion entre distintos lenguajes de programación, para poder comunicar fffs
con el playout
***** transcoding
:PROPERTIES:
:priority: Y
:END:
conversion entre formatos: pasar cualquier formato de entrada a un formato
normalizado
***** plugins
****** deteccion aplanamiento colorspace
****** deteccion silencio
****** deteccion cuadros negros
***** clasificarlos para el futuro uso, e indexacion rapida.
****** filter md5
obtener un fingerprint del archivo para darnos cuenta si algo cambio y
detectar archivos repetidos
****** filter mongo
cargar la metadata en la base de datos

****** filtro_generico
***** convertir al formato y estandard de uso interno al system,
****** mapping node-config -> libav{codec,format}

***** extraccion/agregacion de metadata
****** filter_grilo
****** filter_avmetadata

**** tags de contenidos
:PROPERTIES:
:Effort:   8
:END:
***** filesystem
***** ui
***** search
***** integracion de grafica
***** UI
interfaz de usuario
***** search
***** FS
features necesarias en fffs para soportar tags
****** filter ffmpeg
****** filter grilo
****** perceptua hash
***** grafica
****** autogenerar grafica por tag
generar campos como "nombre de artista" o "nombre del tema" directamente
desde la metadata de la media
*** Administracion
**** listas autogeneradas
:PROPERTIES:
:Effort:   5
:END:
+ por tag
+ aleatorio
+ por ultimo ingestado
+ por metadata
+ por frecuencia
***** UI 
**** Configuracion centralizada
:PROPERTIES:
:Effort:   5
:priority: Y
:END:
***** UI
:PROPERTIES:
:priority: Y
:END:
****** widgets
****** polish
***** mosto drivers
**** Edicion no lineal basica: in, out, cut
:PROPERTIES:
:Effort:   8
:END:
***** stream MLT
**** herencia entre playlists
usar las playlists como templates sobre occurrences. Es decir,
tener la posibilidad de modificar una playlist y elegir si ese cambio
afecta o no las occurrences ya programadas, o poder modificar una
occurrence en particular
:PROPERTIES:
:Effort:   3
:END:
***** backbone relational
*** Generacion de Graficos
**** Edicion de Graficos
:PROPERTIES:
:Effort:   13
:END:
**** Composición de diferentes ingestas en una señal de video,
 usando diversos efectos gráficos para una suave transición.
**** Composición o mezcla de audio y sonido por separado.
**** Inserción de gráficos para diversos usos.
 Inserción de Logos,
 identificación del Canal, etc.
**** Inserción de subtítulos y textos varios (placas).
placas inteligentes
**** Filtros
**** Conversión de aspectos, tonalidades, colores, etc.
**** Zocalos dinamicos, independientes de la playlist o el clip (con su propio schedule)

**** TODO

*** Programacion
**** Configuración Web de la programacion con vista de calendario
:PROPERTIES:
:Effort:   8
:END:
**** Reproducción automática
:PROPERTIES:
:Effort:   13
:priority: Y
:END:
de las diferentes fuentes y emisión del contenido al canal, según el
calendario
***** mosto / refactor
:PROPERTIES:
:priority: Y
:END:
****** backbone playlist (fetch)
:PROPERTIES:
:priority: Y
:END:
****** backbone sync
:PROPERTIES:
:priority: Y
:END:
****** migrar a event emitter
:PROPERTIES:
:priority: Y
:END:
****** backbone drivers
       :PROPERTIES:
       :priority: Y
       :END:
****** Driver MVCP
migrar a C++
**** Vista aplanada del calendario: playout view
:PROPERTIES:
:Effort:   5
:priority: Y
:END:
***** snap UI
cuando ponemos un programa que pisa otro, la UI automaticamente lo pega al final del
programa anterior. Queremos una UI que le avise al usuario lo que está pasando
***** shadow size
***** update FullCalendar
***** Occurrence edit time
poder elegir el horario exacto de un programa al ponerlo al aire
**** override rapido de contenidos al aire
:PROPERTIES:
:Effort:   1
:END:
***** play now view
sobreescribir la programación que está al aire en el momento, por emergencias, etc
***** mosto override
**** Streamer MELT
:PROPERTIES:
:Effort:   21
:END:
*** Monitoreo
**** Estatus en tiempo real del aire
:PROPERTIES:
:Effort:   2
:END:
**** Demonios de control
:PROPERTIES:
:Effort:   8
:END:
**** reporte de reproducion/programacion
:PROPERTIES:
:Effort:   2
:END:

*** Playout
:PROPERTIES:
:END:
**** Melted Multicast
:PROPERTIES:
:priority: Y
:END:
***** Streaming a Web
:PROPERTIES:
:Effort:   5
:priority: Y
:END:

***** Playout a SDI
:PROPERTIES:
:Effort:   1
:END:
***** Playout a compuesto
:PROPERTIES:
:Effort:   1
:priority: Y
:END:
***** Streaming TS para TDA
:PROPERTIES:
:Effort:   2
:END:

* Pruebas
** MBC-PLAYOUT
*** Tests Unitarios
*** Tests Funcionales
*** Alpha testing
*** Beta Testing
*** Cyclos RC
